# Object creation (2024-01-26)

In [1]:
import numpy as np
import pandas as pd

In [2]:
s = pd.Series([1, 3, 5, np.nan, 6, 8])
s

0    1.0
1    3.0
2    5.0
3    NaN
4    6.0
5    8.0
dtype: float64

In [3]:
dates = pd.date_range("20130101", periods=6)
dates

DatetimeIndex(['2013-01-01', '2013-01-02', '2013-01-03', '2013-01-04',
               '2013-01-05', '2013-01-06'],
              dtype='datetime64[ns]', freq='D')

In [4]:
df = pd.DataFrame(np.random.randn(6,4), index=dates, columns=list("ABCD"))
df

                   A         B         C         D
2013-01-01 -0.821609 -0.743937 -1.253192 -0.374935
2013-01-02 -0.680844 -0.462798  1.163811  2.723767
2013-01-03  1.554955  0.185598  1.511667 -0.694739
2013-01-04 -0.104520  1.455947 -1.342441  0.469914
2013-01-05  1.464795 -1.503637 -1.479527 -0.233010
2013-01-06  0.168227  0.116911 -0.573085  0.834738

In [5]:
df2 = pd.DataFrame(
    {
        "A": 1.0,
        "B": pd.Timestamp("20130102"),
        "C": pd.Series(1,index=list(range(4)),dtype="float32"),
        "D": np.array([3]*4, dtype="int32"),
        "E": pd.Categorical(["test", "train", "test", "train"]),
        "F": "foo", #특이한게 ,로 끝내도 되고 아닌 것으로 끝내도 되네?
    }
)
df2

     A          B    C  D      E    F
0  1.0 2013-01-02  1.0  3   test  foo
1  1.0 2013-01-02  1.0  3  train  foo
2  1.0 2013-01-02  1.0  3   test  foo
3  1.0 2013-01-02  1.0  3  train  foo

In [6]:
df2.dtypes

A           float64
B    datetime64[ns]
C           float32
D             int32
E          category
F            object
dtype: object

In [7]:
#df2.<TAB> # noqa: E225, E999

#df2.까지 입력후 탭누르라는 의미, vscode에서는 탭안눌러도 자동으로 표시 단 컬럼은 안 표시됨

# Viewing data (2024-01-27)

In [8]:
df.head()

                   A         B         C         D
2013-01-01 -0.821609 -0.743937 -1.253192 -0.374935
2013-01-02 -0.680844 -0.462798  1.163811  2.723767
2013-01-03  1.554955  0.185598  1.511667 -0.694739
2013-01-04 -0.104520  1.455947 -1.342441  0.469914
2013-01-05  1.464795 -1.503637 -1.479527 -0.233010

In [9]:
df.tail(3)

                   A         B         C         D
2013-01-04 -0.104520  1.455947 -1.342441  0.469914
2013-01-05  1.464795 -1.503637 -1.479527 -0.233010
2013-01-06  0.168227  0.116911 -0.573085  0.834738

In [10]:
df.index

DatetimeIndex(['2013-01-01', '2013-01-02', '2013-01-03', '2013-01-04',
               '2013-01-05', '2013-01-06'],
              dtype='datetime64[ns]', freq='D')

In [11]:
df.columns

Index(['A', 'B', 'C', 'D'], dtype='object')

In [12]:
df.to_numpy()

array([[-0.82160944, -0.74393699, -1.25319171, -0.37493517],
       [-0.6808438 , -0.46279812,  1.16381139,  2.72376691],
       [ 1.55495484,  0.18559801,  1.51166748, -0.69473873],
       [-0.10451994,  1.45594673, -1.34244131,  0.46991418],
       [ 1.46479466, -1.50363723, -1.47952707, -0.23301043],
       [ 0.16822728,  0.11691115, -0.5730849 ,  0.83473752]])

In [13]:
df.values

array([[-0.82160944, -0.74393699, -1.25319171, -0.37493517],
       [-0.6808438 , -0.46279812,  1.16381139,  2.72376691],
       [ 1.55495484,  0.18559801,  1.51166748, -0.69473873],
       [-0.10451994,  1.45594673, -1.34244131,  0.46991418],
       [ 1.46479466, -1.50363723, -1.47952707, -0.23301043],
       [ 0.16822728,  0.11691115, -0.5730849 ,  0.83473752]])

In [14]:
df2.dtypes

A           float64
B    datetime64[ns]
C           float32
D             int32
E          category
F            object
dtype: object

In [15]:
df2.to_numpy()

array([[1.0, Timestamp('2013-01-02 00:00:00'), 1.0, 3, 'test', 'foo'],
       [1.0, Timestamp('2013-01-02 00:00:00'), 1.0, 3, 'train', 'foo'],
       [1.0, Timestamp('2013-01-02 00:00:00'), 1.0, 3, 'test', 'foo'],
       [1.0, Timestamp('2013-01-02 00:00:00'), 1.0, 3, 'train', 'foo']],
      dtype=object)

In [16]:
df2.values

array([[1.0, Timestamp('2013-01-02 00:00:00'), 1.0, 3, 'test', 'foo'],
       [1.0, Timestamp('2013-01-02 00:00:00'), 1.0, 3, 'train', 'foo'],
       [1.0, Timestamp('2013-01-02 00:00:00'), 1.0, 3, 'test', 'foo'],
       [1.0, Timestamp('2013-01-02 00:00:00'), 1.0, 3, 'train', 'foo']],
      dtype=object)

In [17]:
df.describe()

              A         B         C         D
count  6.000000  6.000000  6.000000  6.000000
mean   0.263501 -0.158653 -0.328794  0.454289
std    1.031962  1.004532  1.332743  1.247058
min   -0.821609 -1.503637 -1.479527 -0.694739
25%   -0.536763 -0.673652 -1.320129 -0.339454
50%    0.031854 -0.172943 -0.913138  0.118452
75%    1.140653  0.168426  0.729587  0.743532
max    1.554955  1.455947  1.511667  2.723767

In [18]:
df.T
#행과 열을 바꿔주는데 미리 계산되어 있음
#메소드가 아닌 속성임

   2013-01-01  2013-01-02  2013-01-03  2013-01-04  2013-01-05  2013-01-06
A   -0.821609   -0.680844    1.554955   -0.104520    1.464795    0.168227
B   -0.743937   -0.462798    0.185598    1.455947   -1.503637    0.116911
C   -1.253192    1.163811    1.511667   -1.342441   -1.479527   -0.573085
D   -0.374935    2.723767   -0.694739    0.469914   -0.233010    0.834738

In [19]:
df.T.index
#값만 바꿔서 나타내는가해서 확인용으로 해줬는데 인덱스도 확실히 바뀌어있다

Index(['A', 'B', 'C', 'D'], dtype='object')

In [20]:
df.sort_index(axis=1, ascending=False)
#axis = 1 하면 열끼리 정렬하는 것

                   D         C         B         A
2013-01-01 -0.374935 -1.253192 -0.743937 -0.821609
2013-01-02  2.723767  1.163811 -0.462798 -0.680844
2013-01-03 -0.694739  1.511667  0.185598  1.554955
2013-01-04  0.469914 -1.342441  1.455947 -0.104520
2013-01-05 -0.233010 -1.479527 -1.503637  1.464795
2013-01-06  0.834738 -0.573085  0.116911  0.168227

In [21]:
df.sort_values(by="B")
#df안에 있는 특정 열의 값에 대해서 정렬해줄 수 있음

                   A         B         C         D
2013-01-05  1.464795 -1.503637 -1.479527 -0.233010
2013-01-01 -0.821609 -0.743937 -1.253192 -0.374935
2013-01-02 -0.680844 -0.462798  1.163811  2.723767
2013-01-06  0.168227  0.116911 -0.573085  0.834738
2013-01-03  1.554955  0.185598  1.511667 -0.694739
2013-01-04 -0.104520  1.455947 -1.342441  0.469914

# Selection (2024-01-28)

## Getitem ([])

In [22]:
df["A"]

2013-01-01   -0.821609
2013-01-02   -0.680844
2013-01-03    1.554955
2013-01-04   -0.104520
2013-01-05    1.464795
2013-01-06    0.168227
Freq: D, Name: A, dtype: float64

In [23]:
df[0:3]

                   A         B         C         D
2013-01-01 -0.821609 -0.743937 -1.253192 -0.374935
2013-01-02 -0.680844 -0.462798  1.163811  2.723767
2013-01-03  1.554955  0.185598  1.511667 -0.694739

In [24]:
df["20130102":"20130104"]

                   A         B         C         D
2013-01-02 -0.680844 -0.462798  1.163811  2.723767
2013-01-03  1.554955  0.185598  1.511667 -0.694739
2013-01-04 -0.104520  1.455947 -1.342441  0.469914

## Selection by label

In [25]:
df.loc[dates[0]]

A   -0.821609
B   -0.743937
C   -1.253192
D   -0.374935
Name: 2013-01-01 00:00:00, dtype: float64

In [26]:
df.loc[dates[0],:]

A   -0.821609
B   -0.743937
C   -1.253192
D   -0.374935
Name: 2013-01-01 00:00:00, dtype: float64

In [27]:
df.loc[:,["A","B"]]

                   A         B
2013-01-01 -0.821609 -0.743937
2013-01-02 -0.680844 -0.462798
2013-01-03  1.554955  0.185598
2013-01-04 -0.104520  1.455947
2013-01-05  1.464795 -1.503637
2013-01-06  0.168227  0.116911

In [28]:
df.loc["20130102":"20130104",["A","B"]]

                   A         B
2013-01-02 -0.680844 -0.462798
2013-01-03  1.554955  0.185598
2013-01-04 -0.104520  1.455947

In [29]:
df.loc["20130102":"20130104",["B","A"]]

                   B         A
2013-01-02 -0.462798 -0.680844
2013-01-03  0.185598  1.554955
2013-01-04  1.455947 -0.104520

In [30]:
df.loc[dates[0],"A"]

-0.8216094385573308

In [31]:
df.at[dates[0],"A"]

-0.8216094385573308

## Selection by position

In [32]:
df.iloc[3]

A   -0.104520
B    1.455947
C   -1.342441
D    0.469914
Name: 2013-01-04 00:00:00, dtype: float64

In [33]:
df.iloc[3:5, 0:2]

                   A         B
2013-01-04 -0.104520  1.455947
2013-01-05  1.464795 -1.503637

In [34]:
#비교 loc는 슬라이싱 할때 끝부분까지로 인식(끝부분 포함됨) iloc는 끝부분제외
#df.loc[3:5, 0:2] 아 맞다 이런 식으로 숫자 인덱스로 안됬다
df.loc["20130104":"20130105", "A":"B"]

                   A         B
2013-01-04 -0.104520  1.455947
2013-01-05  1.464795 -1.503637

In [35]:
df.iloc[[1,2,4],[0,2]]

                   A         C
2013-01-02 -0.680844  1.163811
2013-01-03  1.554955  1.511667
2013-01-05  1.464795 -1.479527

In [36]:
df.iloc[1:3, :]

                   A         B         C         D
2013-01-02 -0.680844 -0.462798  1.163811  2.723767
2013-01-03  1.554955  0.185598  1.511667 -0.694739

In [37]:
df.iloc[:, 1:3]

                   B         C
2013-01-01 -0.743937 -1.253192
2013-01-02 -0.462798  1.163811
2013-01-03  0.185598  1.511667
2013-01-04  1.455947 -1.342441
2013-01-05 -1.503637 -1.479527
2013-01-06  0.116911 -0.573085

In [38]:
df.iloc[1,1]

-0.4627981192703368

In [39]:
df.iat[1,1]

-0.4627981192703368

## Boolean indexing (조건에 따른 컬럼 선택)

In [40]:
df[df["A"] > 0]

                   A         B         C         D
2013-01-03  1.554955  0.185598  1.511667 -0.694739
2013-01-05  1.464795 -1.503637 -1.479527 -0.233010
2013-01-06  0.168227  0.116911 -0.573085  0.834738

In [41]:
df[df>0]

                   A         B         C         D
2013-01-01       NaN       NaN       NaN       NaN
2013-01-02       NaN       NaN  1.163811  2.723767
2013-01-03  1.554955  0.185598  1.511667       NaN
2013-01-04       NaN  1.455947       NaN  0.469914
2013-01-05  1.464795       NaN       NaN       NaN
2013-01-06  0.168227  0.116911       NaN  0.834738

In [42]:
df2=df.copy()
df2["E"]=["one", "one", "two", "three", "four", "three"]
df2

                   A         B         C         D      E
2013-01-01 -0.821609 -0.743937 -1.253192 -0.374935    one
2013-01-02 -0.680844 -0.462798  1.163811  2.723767    one
2013-01-03  1.554955  0.185598  1.511667 -0.694739    two
2013-01-04 -0.104520  1.455947 -1.342441  0.469914  three
2013-01-05  1.464795 -1.503637 -1.479527 -0.233010   four
2013-01-06  0.168227  0.116911 -0.573085  0.834738  three

In [43]:
df2[df2["E"].isin(["two", "four"])]
#isin()안에 []로 넣어야하는 듯 (한 개의 경우에도)

                   A         B         C         D     E
2013-01-03  1.554955  0.185598  1.511667 -0.694739   two
2013-01-05  1.464795 -1.503637 -1.479527 -0.233010  four

## Setting

In [44]:
s1 = pd.Series([1,2,3,4,5,6], index=pd.date_range("20130102", periods=6))
s1

2013-01-02    1
2013-01-03    2
2013-01-04    3
2013-01-05    4
2013-01-06    5
2013-01-07    6
Freq: D, dtype: int64

In [45]:
df["F"]=s1

In [46]:
df.at[dates[0],"A"] = 0
df

                   A         B         C         D    F
2013-01-01  0.000000 -0.743937 -1.253192 -0.374935  NaN
2013-01-02 -0.680844 -0.462798  1.163811  2.723767  1.0
2013-01-03  1.554955  0.185598  1.511667 -0.694739  2.0
2013-01-04 -0.104520  1.455947 -1.342441  0.469914  3.0
2013-01-05  1.464795 -1.503637 -1.479527 -0.233010  4.0
2013-01-06  0.168227  0.116911 -0.573085  0.834738  5.0

In [47]:
df.iat[0, 1] = 0
df

                   A         B         C         D    F
2013-01-01  0.000000  0.000000 -1.253192 -0.374935  NaN
2013-01-02 -0.680844 -0.462798  1.163811  2.723767  1.0
2013-01-03  1.554955  0.185598  1.511667 -0.694739  2.0
2013-01-04 -0.104520  1.455947 -1.342441  0.469914  3.0
2013-01-05  1.464795 -1.503637 -1.479527 -0.233010  4.0
2013-01-06  0.168227  0.116911 -0.573085  0.834738  5.0

In [48]:
len(df)

6

In [49]:
df.loc[:, "D"] = np.array([5]*len(df))
df

                   A         B         C    D    F
2013-01-01  0.000000  0.000000 -1.253192  5.0  NaN
2013-01-02 -0.680844 -0.462798  1.163811  5.0  1.0
2013-01-03  1.554955  0.185598  1.511667  5.0  2.0
2013-01-04 -0.104520  1.455947 -1.342441  5.0  3.0
2013-01-05  1.464795 -1.503637 -1.479527  5.0  4.0
2013-01-06  0.168227  0.116911 -0.573085  5.0  5.0

In [50]:
df2 = df.copy()
df2[df2 > 0] = -df2
df2

                   A         B         C    D    F
2013-01-01  0.000000  0.000000 -1.253192 -5.0  NaN
2013-01-02 -0.680844 -0.462798 -1.163811 -5.0 -1.0
2013-01-03 -1.554955 -0.185598 -1.511667 -5.0 -2.0
2013-01-04 -0.104520 -1.455947 -1.342441 -5.0 -3.0
2013-01-05 -1.464795 -1.503637 -1.479527 -5.0 -4.0
2013-01-06 -0.168227 -0.116911 -0.573085 -5.0 -5.0

# Missing data (2024-01-29)

In [51]:
df1 = df.reindex(index=dates[0:4], columns=list(df.columns)+["E"])
df.loc[dates[0]:dates[1], "E"] = 1
df1

                   A         B         C    D    F   E
2013-01-01  0.000000  0.000000 -1.253192  5.0  NaN NaN
2013-01-02 -0.680844 -0.462798  1.163811  5.0  1.0 NaN
2013-01-03  1.554955  0.185598  1.511667  5.0  2.0 NaN
2013-01-04 -0.104520  1.455947 -1.342441  5.0  3.0 NaN

In [52]:
df1.dropna(how="any") #결측치 있으면 다 제거하는 옵션인듯?

Empty DataFrame
Columns: [A, B, C, D, F, E]
Index: []

In [53]:
df1.fillna(value=5) #결측치를 특정 값으로 다 바꿔서 채우는 방법

                   A         B         C    D    F    E
2013-01-01  0.000000  0.000000 -1.253192  5.0  5.0  5.0
2013-01-02 -0.680844 -0.462798  1.163811  5.0  1.0  5.0
2013-01-03  1.554955  0.185598  1.511667  5.0  2.0  5.0
2013-01-04 -0.104520  1.455947 -1.342441  5.0  3.0  5.0

In [54]:
pd.isna(df1) #결측치가 있는가에 대한 T/F판단 있으면 T

                A      B      C      D      F     E
2013-01-01  False  False  False  False   True  True
2013-01-02  False  False  False  False  False  True
2013-01-03  False  False  False  False  False  True
2013-01-04  False  False  False  False  False  True

# Operations (2024-01-30)

## Stats

In [55]:
df

                   A         B         C    D    F    E
2013-01-01  0.000000  0.000000 -1.253192  5.0  NaN  1.0
2013-01-02 -0.680844 -0.462798  1.163811  5.0  1.0  1.0
2013-01-03  1.554955  0.185598  1.511667  5.0  2.0  NaN
2013-01-04 -0.104520  1.455947 -1.342441  5.0  3.0  NaN
2013-01-05  1.464795 -1.503637 -1.479527  5.0  4.0  NaN
2013-01-06  0.168227  0.116911 -0.573085  5.0  5.0  NaN

In [56]:
df.mean() #NaN값있으면 합산, 갯수에서 제외하고 평균 내는 듯

A    0.400436
B   -0.034663
C   -0.328794
D    5.000000
F    3.000000
E    1.000000
dtype: float64

In [57]:
print(df.mean(axis=1)) 
# 마찬가지로 NaN값있으면 합산, 갯수에서 제외하고 평균 내는 듯, 단 axis=1이면 행 별로 모든 컬럼의 값의 평균 내줌
# axis = 1말고 그냥 인자로 1만 줘도 동일한 결과가 나오는 듯 함

2013-01-01    0.949362
2013-01-02    1.170028
2013-01-03    2.050444
2013-01-04    1.601797
2013-01-05    1.496326
2013-01-06    1.942411
Freq: D, dtype: float64

In [58]:
s = pd.Series([1, 3, 5, np.nan, 6, 8], index=dates)
s

2013-01-01    1.0
2013-01-02    3.0
2013-01-03    5.0
2013-01-04    NaN
2013-01-05    6.0
2013-01-06    8.0
Freq: D, dtype: float64

In [59]:
s = pd.Series([1, 3, 5, np.nan, 6, 8], index=dates).shift(2)
s

2013-01-01    NaN
2013-01-02    NaN
2013-01-03    1.0
2013-01-04    3.0
2013-01-05    5.0
2013-01-06    NaN
Freq: D, dtype: float64

>https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.Series.html#pandas.Series     
Series의 메소드인 shift가 뭐하는 녀석인지 몰라서 문서에 들어가보니 아래와 같이 서술되어있었다   
shift([periods, freq, axis, fill_value, suffix])    
Shift index by desired number of periods with an optional time freq.    
자세한 내용은 모르겠지만 대강 값들을 index를 기준으로 준 값만큼 이동시키는 듯하다   
1일과 2일의 경우 이전 인덱스에 해당하는 데이터가 없으니 NaN로 결측치가 된 것이고    
3,4,5일의 경우 인덱스상으로 2이전의 값들이 존재했으니 해당값들로 바뀌었고   
6일의 경우 인덱스상으로 2이전의 값이 NaN로 결측치 였기에 결측치로 되었는 듯하다.

In [60]:
df.sub(s, axis='index')

                   A         B         C    D    F   E
2013-01-01       NaN       NaN       NaN  NaN  NaN NaN
2013-01-02       NaN       NaN       NaN  NaN  NaN NaN
2013-01-03  0.554955 -0.814402  0.511667  4.0  1.0 NaN
2013-01-04 -3.104520 -1.544053 -4.342441  2.0  0.0 NaN
2013-01-05 -3.535205 -6.503637 -6.479527  0.0 -1.0 NaN
2013-01-06       NaN       NaN       NaN  NaN  NaN NaN

>https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.DataFrame.html#pandas.DataFrame
이번엔 df의 메소드인 sub에 대하여 설명이 없어서 찾아보니 아래와 같이 메소드로 설명되어있었고 잘 이해가 되지 않아 좀더 자세한 독스에 들어갔다    
sub(other[, axis, level, fill_value])       
Get Subtraction of dataframe and other, element-wise (binary operator sub).     
https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.DataFrame.sub.html#pandas.DataFrame.sub   
DataFrame.sub(other, axis='columns', level=None, fill_value=None)   
대강 구조를 보니 df에 대하여 빼기를 해주는데 sub()안에 들어있는 값으로 빼주는 것으로 들어올 수 있는 other로는 scalar, sequence, Series, dict or DataFrame이 가능하다고 한다 이중 sequence는 정확히 뭔지 모르겠어서 찾아보니     
https://wikidocs.net/84391      
내용을 참고하였다 대강 리스트, 문자열, 튜플 이 세가지 자료형이라고 생각하면 될듯하다    
그리고 axis에 대하여 0 or index , 1 or columns의 옵션이 있는데 기본값은 colunms로 되어있다  
fill_value는 결측치를 만났을 때 특정값으로 바꿔넣어줄 것인지 선택하는 옵션으로 기본값은 none로 되어있다     
level 옵션에 대해서는 잘모르겠다 예제도 한문제 뿐인데 잘 이해가 되지 않는다 대강 멀티인덱스를 사용할 경우에 사용하는 느낌인데 예제를 아래 그대로 가져와서 해보고 이해해보도록 하겠다

### level 예제

In [61]:
level_example_df = pd.DataFrame({'angles': [0, 3, 4],
                   'degrees': [360, 180, 360]},
                  index=['circle', 'triangle', 'rectangle'])
level_example_df

           angles  degrees
circle          0      360
triangle        3      180
rectangle       4      360

In [62]:
level_example_df_multindex = pd.DataFrame({'angles': [0, 3, 4, 4, 5, 6],
                             'degrees': [360, 180, 360, 360, 540, 720]},
                            index=[['A', 'A', 'A', 'B', 'B', 'B'],
                                   ['circle', 'triangle', 'rectangle',
                                    'square', 'pentagon', 'hexagon']])
level_example_df_multindex

             angles  degrees
A circle          0      360
  triangle        3      180
  rectangle       4      360
B square          4      360
  pentagon        5      540
  hexagon         6      720

In [63]:
print(level_example_df.div(level_example_df_multindex, level=1))
#원래 예제에는 ,fill_value=0으로 결측치 0으로 바꿔주는 옵션이 추가되어있었다
#뭔가 알듯말듯한데 chatGPT를 통해 설명을 들으니 알 것 같았다
#https://chat.openai.com/share/73654015-96b4-4fb3-b6e3-243526afb670

             angles  degrees
A circle        NaN      1.0
  triangle      1.0      1.0
  rectangle     1.0      1.0
B square        NaN      NaN
  pentagon      NaN      NaN
  hexagon       NaN      NaN

## User defined functions

In [64]:
display(df)
print(df.mean(),'\n')
print(df.mean()*5.6)

                   A         B         C    D    F    E
2013-01-01  0.000000  0.000000 -1.253192  5.0  NaN  1.0
2013-01-02 -0.680844 -0.462798  1.163811  5.0  1.0  1.0
2013-01-03  1.554955  0.185598  1.511667  5.0  2.0  NaN
2013-01-04 -0.104520  1.455947 -1.342441  5.0  3.0  NaN
2013-01-05  1.464795 -1.503637 -1.479527  5.0  4.0  NaN
2013-01-06  0.168227  0.116911 -0.573085  5.0  5.0  NaN

A    0.400436
B   -0.034663
C   -0.328794
D    5.000000
F    3.000000
E    1.000000
dtype: float64

A     2.242439
B    -0.194114
C    -1.841248
D    28.000000
F    16.800000
E     5.600000
dtype: float64

In [65]:
df.agg(lambda x: np.mean(x)*5.6)

A     2.242439
B    -0.194114
C    -1.841248
D    28.000000
F    16.800000
E     5.600000
dtype: float64

In [66]:
df*101.2

                     A           B           C      D      F      E
2013-01-01    0.000000    0.000000 -126.823001  506.0    NaN  101.2
2013-01-02  -68.901393  -46.835170  117.777713  506.0  101.2  101.2
2013-01-03  157.361430   18.782519  152.980749  506.0  202.4    NaN
2013-01-04  -10.577418  147.341809 -135.855061  506.0  303.6    NaN
2013-01-05  148.237220 -152.168088 -149.728139  506.0  404.8    NaN
2013-01-06   17.024600   11.831408  -57.996192  506.0  506.0    NaN

In [67]:
df.transform(lambda x: x*101.2)

                     A           B           C      D      F      E
2013-01-01    0.000000    0.000000 -126.823001  506.0    NaN  101.2
2013-01-02  -68.901393  -46.835170  117.777713  506.0  101.2  101.2
2013-01-03  157.361430   18.782519  152.980749  506.0  202.4    NaN
2013-01-04  -10.577418  147.341809 -135.855061  506.0  303.6    NaN
2013-01-05  148.237220 -152.168088 -149.728139  506.0  404.8    NaN
2013-01-06   17.024600   11.831408  -57.996192  506.0  506.0    NaN

agg는 대강은 알듯한데 transform은 agg와 뭐가 다른지 모르겠다    
추가로 유사한 것에 apply도 있던 것으로 기억하는데 여기는 왜 빠져있고 차이가 뭔지도 궁금하다     
https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.DataFrame.agg.html#pandas.DataFrame.agg   
https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.DataFrame.transform.html#pandas.DataFrame.transform   
https://pandas.pydata.org/pandas-docs/stable/user_guide/gotchas.html#gotchas-udf-mutation   
chatGPT에게 차이를 물어본 내용:
https://chat.openai.com/share/654feb01-8d50-481e-8c7a-ca160e1e74a4

## Value Counts

In [68]:
s = pd.Series(np.random.randint(0,7,size=10))
s

0    5
1    4
2    4
3    1
4    0
5    2
6    0
7    4
8    5
9    5
dtype: int32

In [69]:
s.value_counts()

5    3
4    3
0    2
1    1
2    1
Name: count, dtype: int64

## String Methods

In [70]:
s = pd.Series(["A", "B", "C", "Aaba", "Baca", np.nan, "CABA", "dog", "cat"])
print(s)
s.str.lower()

0       A
1       B
2       C
3    Aaba
4    Baca
5     NaN
6    CABA
7     dog
8     cat
dtype: object

0       a
1       b
2       c
3    aaba
4    baca
5     NaN
6    caba
7     dog
8     cat
dtype: object

pandas.Series:
https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.Series.html#pandas.Series     
Vectorized String Methods:
https://pandas.pydata.org/pandas-docs/stable/user_guide/text.html#text-string-methods

# Merge (2024-01-31)

## Concat

In [71]:
df = pd.DataFrame(np.random.randn(10,4)) 
#np.random.randn(m,n) : 평균0, 표준편차1의 가우시안 표준정규분포 난수를 matrix array(m,n) 생성
df

          0         1         2         3
0  0.980632 -0.981833  0.170015  0.421439
1  0.881178 -0.339086 -0.865187  1.760811
2  0.539575 -0.746596  1.478673  0.034552
3  0.902935 -0.797853  1.073141  1.886055
4  0.559513 -1.933221 -1.443257  1.218620
5 -0.854190 -0.814830  0.526831 -1.101172
6 -1.621625 -0.219536 -0.786079 -3.772835
7  0.436586 -1.389905 -0.025863  0.683391
8 -1.040737  0.298866  0.429410  0.110405
9 -2.002718 -0.559979 -1.167494  0.304946

np.random.randn(m,n) https://nittaku.tistory.com/443    
docs : https://numpy.org/doc/stable/reference/random/generated/numpy.random.randn.html

In [72]:
pieces = [df[:3], df[3:7], df[7:]]
pieces

[          0         1         2         3
 0  0.980632 -0.981833  0.170015  0.421439
 1  0.881178 -0.339086 -0.865187  1.760811
 2  0.539575 -0.746596  1.478673  0.034552,
           0         1         2         3
 3  0.902935 -0.797853  1.073141  1.886055
 4  0.559513 -1.933221 -1.443257  1.218620
 5 -0.854190 -0.814830  0.526831 -1.101172
 6 -1.621625 -0.219536 -0.786079 -3.772835,
           0         1         2         3
 7  0.436586 -1.389905 -0.025863  0.683391
 8 -1.040737  0.298866  0.429410  0.110405
 9 -2.002718 -0.559979 -1.167494  0.304946]

In [73]:
pd.concat(pieces)

          0         1         2         3
0  0.980632 -0.981833  0.170015  0.421439
1  0.881178 -0.339086 -0.865187  1.760811
2  0.539575 -0.746596  1.478673  0.034552
3  0.902935 -0.797853  1.073141  1.886055
4  0.559513 -1.933221 -1.443257  1.218620
5 -0.854190 -0.814830  0.526831 -1.101172
6 -1.621625 -0.219536 -0.786079 -3.772835
7  0.436586 -1.389905 -0.025863  0.683391
8 -1.040737  0.298866  0.429410  0.110405
9 -2.002718 -0.559979 -1.167494  0.304946

## Join

In [74]:
left = pd.DataFrame({"key": ["foo", "foo"], "lval": [1, 2]})
right = pd.DataFrame({"key": ["foo", "foo"], "rval": [4, 5]})
left

   key  lval
0  foo     1
1  foo     2

In [75]:
right

   key  rval
0  foo     4
1  foo     5

In [76]:
pd.merge(left, right, on="key")

   key  lval  rval
0  foo     1     4
1  foo     1     5
2  foo     2     4
3  foo     2     5

In [77]:
left = pd.DataFrame({"key": ["foo", "bar"], "lval": [1, 2]})
right = pd.DataFrame({"key": ["foo", "bar"], "rval": [4, 5]})
left

   key  lval
0  foo     1
1  bar     2

In [78]:
right

   key  rval
0  foo     4
1  bar     5

In [79]:
pd.merge(left, right, on="key")

   key  lval  rval
0  foo     1     4
1  bar     2     5

# Grouping (2024-02-01)

Splitting the data into groups based on some criteria

Applying a function to each group independently

Combining the results into a data structure

In [81]:
df = pd.DataFrame(
    {"A": ["foo", "bar", "foo", "bar", "foo", "bar", "foo", "foo"], 
     "B": ["one", "one", "two", "three", "two", "two", "one", "three"], 
     "C": np.random.randn(8),
     "D": np.random.randn(8),}
)
df

     A      B         C         D
0  foo    one -0.691579 -1.073753
1  bar    one  0.343489 -0.013786
2  foo    two -0.220904 -0.945009
3  bar  three -1.080407  0.726742
4  foo    two  0.707152  0.461618
5  bar    two -1.609870  0.089083
6  foo    one  0.765304  0.873919
7  foo  three  0.290665  0.724316

In [82]:
df.groupby("A")[["C", "D"]].sum()

            C         D
A
bar -2.346789  0.802040
foo  0.850637  0.041092

In [83]:
df.groupby(["A", "B"]).sum()

                  C         D
A   B
bar one    0.343489 -0.013786
    three -1.080407  0.726742
    two   -1.609870  0.089083
foo one    0.073725 -0.199834
    three  0.290665  0.724316
    two    0.486247 -0.483390

자동으로 commit되게 yml추가해준 것 테스트용도